In [3]:
#Question 1
import pandas as pd
import numpy as np
data = [4,8,15,16,23,42]
srs = pd.Series(data)
srs

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [18]:
#Question 2
arr = np.random.randint(0,10,10)
lst = list(arr)
lst
srs2 = pd.Series(lst)
srs2

0    8
1    1
2    3
3    1
4    1
5    3
6    3
7    4
8    8
9    6
dtype: int32

In [39]:
#Question 3
data = [['alice',25,"female"],["bob",30,"male"],['claire',27,'female']]
df = pd.DataFrame(data, columns = ['Name','age','Gender'])
df

     Name  age  Gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

In [35]:
#Question 4
'''Series is one dimensional where as pandas is two dimensional'''
lst = [1,2,3,4,5]
df = pd.Series(lst)
type(df)

pandas.core.series.Series

In [38]:
df = pd.DataFrame([lst])
df
type(df)

pandas.core.frame.DataFrame

In [42]:
#Question 5
data = [['alice',25,"female"],["bob",30,"male"],['claire',27,'female']]
df = pd.DataFrame(data, columns = ['Name','age','Gender'])
df['Name']

0     alice
1       bob
2    claire
Name: Name, dtype: object

In [43]:
#Question 6
'''series as size mutable but not value mutable where as Dataframes as value mutable also'''

'series as size mutable but not value mutable where as Dataframes as value mutable also'

In [45]:
#Question 7
df1 = pd.Series([1,2,3,4,5])
df2 = pd.Series([2,4,6,6,7])
df3 = pd.DataFrame([df1,df2])
df3

   0  1  2  3  4
0  1  2  3  4  5
1  2  4  6  6  7